iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_CMSIS/startup/iar/startup_TMPM475.s
;/**
; *******************************************************************************
; * @file    startup_TMPM475.s
; * @brief   CMSIS Cortex-M4 Core Device Startup File for the
; *          TOSHIBA 'TMPM475' Device Series
; * @version V2.0.2.5 (Tentative)
; * @date    2015/03/06
; * 
; * DO NOT USE THIS SOFTWARE WITHOUT THE SOFTWARE LISENCE AGREEMENT.
; * 
; * (C)Copyright TOSHIBA CORPORATION 2015 All rights reserved
; *******************************************************************************
; */
;
; The modules in this file are included in the libraries, and may be replaced
; by any user-defined modules that define the PUBLIC symbol _program_start or
; a user defined start symbol.
; To override the cstartup defined in the library, simply add your modified
; version to the workbench project.
;
; Cortex-M version
;

                MODULE  ?cstartup

                ;; Forward declaration of sections.
                SECTION CSTACK:DATA:NOROOT(3)

                SECTION .intvec:CODE:NOROOT(2)

                EXTERN  __iar_program_start
                EXTERN  SystemInit
                PUBLIC  __vector_table

                DATA
__vector_table  DCD     sfe(CSTACK)
                DCD     Reset_Handler

                DCD     NMI_Handler               ; NMI Handler
                DCD     HardFault_Handler         ; Hard Fault Handler
                DCD     MemManage_Handler         ; MPU Fault Handler
                DCD     BusFault_Handler          ; Bus Fault Handler
                DCD     UsageFault_Handler        ; Usage Fault Handler
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     0                         ; Reserved
                DCD     SVC_Handler               ; SVCall Handler
                DCD     DebugMon_Handler          ; Debug Monitor Handler
                DCD     0                         ; Reserved
                DCD     PendSV_Handler            ; PendSV Handler
                DCD     SysTick_Handler           ; SysTick Handler

                ; External Interrupts
                DCD     INT0_IRQHandler           ; 0:	Interrupt pin (PH0/AINA0/INT0)
                DCD     INT1_IRQHandler           ; 1:	Interrupt pin (PH1/AINA1/INT1)
                DCD     INT2_IRQHandler           ; 2:	Interrupt pin (PH2/AINA2/INT2)
                DCD     INT3_IRQHandler           ; 3:	Interrupt pin (PA0/TB0IN/INT3)
                DCD     INT4_IRQHandler           ; 4:	Interrupt pin (PA2/TB1IN/INT4)
                DCD     INT5_IRQHandler           ; 5:	Interrupt pin (PE4/TB2IN/INT5)
                DCD     INTRX0_IRQHandler         ; 6:	Serial reception (channel 0)
                DCD     INTTX0_IRQHandler         ; 7:	Serial transmit (channel 0)
                DCD     INTRX1_IRQHandler         ; 8:	Serial reception (channel 1)
                DCD     INTTX1_IRQHandler         ; 9:	Serial transmit (channel 1)
                DCD     INTVCN0_IRQHandler        ; 10:	Vector Engine interrupt 0
                DCD     INTVCN1_IRQHandler        ; 11:	Vector Engine interrupt 1
                DCD     INTEMG0_IRQHandler        ; 12:	PMD0 EMG interrupt
                DCD     INTEMG1_IRQHandler        ; 13:	PMD1 EMG interrupt
                DCD     INTOVV0_IRQHandler        ; 14:	PMD0 OVV interrupt
                DCD     INTOVV1_IRQHandler        ; 15:	PMD1 OVV interrupt
                DCD     INTADAPDA_IRQHandler      ; 16:	ADC unit A conversion triggered by PMD0 is finished
                DCD     INTADBPDA_IRQHandler      ; 17:	ADC unit B conversion triggered by PMD0 is finished
                DCD     INTADAPDB_IRQHandler      ; 18:	ADC unit A conversion triggered by PMD1 is finished
                DCD     INTADBPDB_IRQHandler      ; 19:	ADC unit B conversion triggered by PMD1 is finished
                DCD     INTTB00_IRQHandler        ; 20:	16bit TMRB0 compare match detection 0 / Over flow
                DCD     INTTB01_IRQHandler        ; 21:	16bit TMRB0 compare match detection 1
                DCD     INTTB10_IRQHandler        ; 22:	16bit TMRB1 compare match detection 0 / Over flow
                DCD     INTTB11_IRQHandler        ; 23:	16bit TMRB1 compare match detection 1
                DCD     INTTB40_IRQHandler        ; 24:	16bit TMRB4 compare match detection 0 / Over flow
                DCD     INTTB41_IRQHandler        ; 25:	16bit TMRB4 compare match detection 1
                DCD     INTTB50_IRQHandler        ; 26:	16bit TMRB5 compare match detection 0 / Over flow
                DCD     INTTB51_IRQHandler        ; 27:	16bit TMRB5 compare match detection 1
                DCD     INTPMD0_IRQHandler        ; 28:	PMD0 PWM interrupt
                DCD     INTPMD1_IRQHandler        ; 29:	PMD1 PWM interrupt
                DCD     INTCAP00_IRQHandler       ; 30:	16bit TMRB0 input capture 0
                DCD     INTCAP01_IRQHandler       ; 31:	16bit TMRB0 input capture 1
                DCD     INTCAP10_IRQHandler       ; 32:	16bit TMRB1 input capture 0
                DCD     INTCAP11_IRQHandler       ; 33:	16bit TMRB1 input capture 1
                DCD     INTCAP40_IRQHandler       ; 34:	16bit TMRB4 input capture 0
                DCD     INTCAP41_IRQHandler       ; 35:	16bit TMRB4 input capture 1
                DCD     INTCAP50_IRQHandler       ; 36:	16bit TMRB5 input capture 0
                DCD     INTCAP51_IRQHandler       ; 37:	16bit TMRB5 input capture 1
                DCD     INT6_IRQHandler           ; 38:	Interrupt pin (PE6/TB3IN/INT6)
                DCD     INT7_IRQHandler           ; 39:	Interrupt pin (PE7/TB3OUT/INT7)
                DCD     INTRX2_IRQHandler         ; 40:	Serial reception (channel 2)
                DCD     INTTX2_IRQHandler         ; 41:	Serial transmit (channel 2)
                DCD     INTADACPA_IRQHandler      ; 42:	ADCA conversion monitoring function interrupt A
                DCD     INTADBCPA_IRQHandler      ; 43:	ADCB conversion monitoring function interrupt A
                DCD     INTADACPB_IRQHandler      ; 44:	ADCA conversion monitoring function interrupt B
                DCD     INTADBCPB_IRQHandler      ; 45:	ADCB conversion monitoring function interrupt B
                DCD     INTTB20_IRQHandler        ; 46:	16bit TMRB2 compare match detection 0 / Over flow
                DCD     INTTB21_IRQHandler        ; 47:	16bit TMRB2 compare match detection 1
                DCD     INTTB30_IRQHandler        ; 48:	16bit TMRB3 compare match detection 0 / Over flow
                DCD     INTTB31_IRQHandler        ; 49:	16bit TMRB3 compare match detection 1
                DCD     INTCAP20_IRQHandler       ; 50:	16bit TMRB2 input capture 0
                DCD     INTCAP21_IRQHandler       ; 51:	16bit TMRB2 input capture 1
                DCD     INTCAP30_IRQHandler       ; 52:	16bit TMRB3 input capture 0
                DCD     INTCAP31_IRQHandler       ; 53:	16bit TMRB3 input capture 1
                DCD     INTADASFT_IRQHandler      ; 54:	ADC unit A conversion started by software is finished
                DCD     INTADBSFT_IRQHandler      ; 55:	ADC unit B conversion started by software is finished
                DCD     INTADATMR_IRQHandler      ; 56:	ADC unit A conversion triggered by timer is finished
                DCD     INTADBTMR_IRQHandler      ; 57:	ADC unit B conversion triggered by timer is finished
                DCD     INT8_IRQHandler           ; 58:	Interrupt pin (PA7/TB4IN/INT8)
                DCD     INT9_IRQHandler           ; 59:	Interrupt pin (PD3/INT9)
                DCD     INTA_IRQHandler           ; 60:	Interrupt pin (PL1/CA_RX/INTA)
                DCD     INTB_IRQHandler           ; 61:	Interrupt pin (PL0/CA_TX/INTB)
                DCD     INTENC00_IRQHandler       ; 62:	Encoder 0 interrupt 0
                DCD     INTENC01_IRQHandler       ; 63:	Encoder 0 interrupt 1
                DCD     INTRX3_IRQHandler         ; 64:	Serial reception (channel 3)
                DCD     INTTX3_IRQHandler         ; 65:	Serial transmit (channel 3)
                DCD     INTTB60_IRQHandler        ; 66:	16bit TMRB6 compare match detection 0 / Over flow
                DCD     INTTB61_IRQHandler        ; 67:	16bit TMRB6 compare match detection 1
                DCD     INTTB70_IRQHandler        ; 68:	16bit TMRB7 compare match detection 0 / Over flow
                DCD     INTTB71_IRQHandler        ; 69:	16bit TMRB7 compare match detection 1
                DCD     INTCAP60_IRQHandler       ; 70:	16bit TMRB6 input capture 0
                DCD     INTCAP61_IRQHandler       ; 71:	16bit TMRB6 input capture 1
                DCD     INTCAP70_IRQHandler       ; 72:	16bit TMRB7 input capture 0
                DCD     INTCAP71_IRQHandler       ; 73:	16bit TMRB7 input capture 1
                DCD     INTC_IRQHandler           ; 74:	Interrupt pin (PJ6/AINB9/INTC)
                DCD     INTD_IRQHandler           ; 75:	Interrupt pin (PJ7/AINB10/INTD)
                DCD     INTE_IRQHandler           ; 76:	Interrupt pin (PK0/TRACEDATA3/INTE)
                DCD     INTF_IRQHandler           ; 77:	Interrupt pin (PK1/TRACEDATA2/INTF)
                DCD     INTVCT0_IRQHandler        ; 78:	Vector Engine 0 task is finished
                DCD     INTVCT1_IRQHandler        ; 79:	Vector Engine 1 task is finished
                DCD     INTSBI0_IRQHandler        ; 80:	Serial bus interface
                DCD     INTCANRX_IRQHandler       ; 81:	CAN transmit completion interrupt
                DCD     INTCANTX_IRQHandler       ; 82:	CAN receive completion interrupt
                DCD     INTCANGB_IRQHandler       ; 83:	CAN Global status interrupt
                DCD     INTTB80_IRQHandler        ; 84:	16bit TMRB8 compare match detection 0 / Over flow
                DCD     INTTB81_IRQHandler        ; 85:	16bit TMRB8 compare match detection 1
                DCD     INTTB90_IRQHandler        ; 86:	16bit TMRB9 compare match detection 0 / Over flow
                DCD     INTTB91_IRQHandler        ; 87:	16bit TMRB9 compare match detection 1
                DCD     INTCAP80_IRQHandler       ; 88:	16bit TMRB8 input capture 0
                DCD     INTCAP81_IRQHandler       ; 89:	16bit TMRB8 input capture 1
                DCD     INTCAP90_IRQHandler       ; 90:	16bit TMRB9 input capture 0
                DCD     INTCAP91_IRQHandler       ; 91:	16bit TMRB9 input capture 1
                DCD     INTDMACATC_IRQHandler     ; 92:	DMA end of transfer
                DCD     INTDMACAERR_IRQHandler    ; 93:	DMA transfer error
                DCD     INTENC10_IRQHandler       ; 94:	Encoder 1 interrupt 0
                DCD     INTENC11_IRQHandler       ; 95:	Encoder 1 interrupt 1
                THUMB
; Dummy Exception Handlers (infinite loops which can be modified)

                PUBWEAK Reset_Handler
                SECTION .text:CODE:REORDER:NOROOT(2)
Reset_Handler
                LDR     R0, =SystemInit
                BLX     R0
                LDR     R0, =__iar_program_start
                BX      R0

                PUBWEAK NMI_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
NMI_Handler
                B       NMI_Handler

                PUBWEAK HardFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
HardFault_Handler
                B       HardFault_Handler

                PUBWEAK MemManage_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
MemManage_Handler
                B       MemManage_Handler

                PUBWEAK BusFault_Handler
                SECTION .text:CODE:REORDER:NOROOT(1)
BusFault_Handler
                B       BusFault_Handler

