iarsystems/ewarm-toshiba-example-projects/TMPM475/Libraries/TX04_CMSIS/startup/iar/startup_TMPM475.s
                PUBWEAK INTCAP71_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP71_IRQHandler
                B       INTCAP71_IRQHandler

                PUBWEAK INTC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTC_IRQHandler
                B       INTC_IRQHandler

                PUBWEAK INTD_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTD_IRQHandler
                B       INTD_IRQHandler

                PUBWEAK INTE_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTE_IRQHandler
                B       INTE_IRQHandler

                PUBWEAK INTF_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTF_IRQHandler
                B       INTF_IRQHandler

                PUBWEAK INTVCT0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTVCT0_IRQHandler
                B       INTVCT0_IRQHandler

                PUBWEAK INTVCT1_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTVCT1_IRQHandler
                B       INTVCT1_IRQHandler

                PUBWEAK INTSBI0_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTSBI0_IRQHandler
                B       INTSBI0_IRQHandler

                PUBWEAK INTCANRX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANRX_IRQHandler
                B       INTCANRX_IRQHandler

                PUBWEAK INTCANTX_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANTX_IRQHandler
                B       INTCANTX_IRQHandler

                PUBWEAK INTCANGB_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCANGB_IRQHandler
                B       INTCANGB_IRQHandler

                PUBWEAK INTTB80_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB80_IRQHandler
                B       INTTB80_IRQHandler

                PUBWEAK INTTB81_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB81_IRQHandler
                B       INTTB81_IRQHandler

                PUBWEAK INTTB90_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB90_IRQHandler
                B       INTTB90_IRQHandler

                PUBWEAK INTTB91_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTTB91_IRQHandler
                B       INTTB91_IRQHandler

                PUBWEAK INTCAP80_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP80_IRQHandler
                B       INTCAP80_IRQHandler

                PUBWEAK INTCAP81_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP81_IRQHandler
                B       INTCAP81_IRQHandler

                PUBWEAK INTCAP90_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP90_IRQHandler
                B       INTCAP90_IRQHandler

                PUBWEAK INTCAP91_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTCAP91_IRQHandler
                B       INTCAP91_IRQHandler

                PUBWEAK INTDMACATC_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACATC_IRQHandler
                B       INTDMACATC_IRQHandler

                PUBWEAK INTDMACAERR_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTDMACAERR_IRQHandler
                B       INTDMACAERR_IRQHandler

                PUBWEAK INTENC10_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC10_IRQHandler
                B       INTENC10_IRQHandler

                PUBWEAK INTENC11_IRQHandler
                SECTION .text:CODE:REORDER:NOROOT(1)
INTENC11_IRQHandler
                B       INTENC11_IRQHandler

                END
